Ac6Embedded/svd-microchip/PIC32CM_SG00/PIC32CM5112SG00064.svd
               <register>
                  <name>CHNCFG5</name>
                  <description>Channel Configuration 5 (TRGSRC)</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>TRGSRC8</name>
                        <description>Channel 8 Trigger Source</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>TRGSRC8Select</name>
                           <enumeratedValue>
                              <name>NO_TRIGGER</name>
                              <description>No Trigger (NOP)</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_SOFTWARE_TRIGGER</name>
                              <description>Global Software Trigger</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_LEVEL_TRIGGER</name>
                              <description>Global Level Software Trigger</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SCAN_TRIGGER</name>
                              <description>SCANTRG - Scan Trigger</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SYNC_TRIGGER</name>
                              <description>Synchronous Trigger (STRIG)</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER0</name>
                              <description>ADC Trigger Event User 0</description>
                              <value>5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER1</name>
                              <description>ADC Trigger Event User 1</description>
                              <value>6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER2</name>
                              <description>ADC Trigger Event User 2</description>
                              <value>7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER3</name>
                              <description>ADC Trigger Event User 3</description>
                              <value>8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER4</name>
                              <description>ADC Trigger Event User 4</description>
                              <value>9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER5</name>
                              <description>ADC Trigger Event User 5</description>
                              <value>10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER6</name>
                              <description>ADC Trigger Event User 6</description>
                              <value>11</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER7</name>
                              <description>ADC Trigger Event User 7</description>
                              <value>12</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER8</name>
                              <description>ADC Trigger Event User 8</description>
                              <value>13</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER9</name>
                              <description>ADC Trigger Event User 9</description>
                              <value>14</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER10</name>
                              <description>ADC Trigger Event User 10</description>
                              <value>15</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TRGSRC9</name>
                        <description>Channel 9 Trigger Source</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>TRGSRC9Select</name>
                           <enumeratedValue>
                              <name>NO_TRIGGER</name>
                              <description>No Trigger (NOP)</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_SOFTWARE_TRIGGER</name>
                              <description>Global Software Trigger</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_LEVEL_TRIGGER</name>
                              <description>Global Level Software Trigger</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SCAN_TRIGGER</name>
                              <description>SCANTRG - Scan Trigger</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SYNC_TRIGGER</name>
                              <description>Synchronous Trigger (STRIG)</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER0</name>
                              <description>ADC Trigger Event User 0</description>
                              <value>5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER1</name>
                              <description>ADC Trigger Event User 1</description>
                              <value>6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER2</name>
                              <description>ADC Trigger Event User 2</description>
                              <value>7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER3</name>
                              <description>ADC Trigger Event User 3</description>
                              <value>8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER4</name>
                              <description>ADC Trigger Event User 4</description>
                              <value>9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER5</name>
                              <description>ADC Trigger Event User 5</description>
                              <value>10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER6</name>
                              <description>ADC Trigger Event User 6</description>
                              <value>11</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER7</name>
                              <description>ADC Trigger Event User 7</description>
                              <value>12</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER8</name>
                              <description>ADC Trigger Event User 8</description>
                              <value>13</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER9</name>
                              <description>ADC Trigger Event User 9</description>
                              <value>14</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER10</name>
                              <description>ADC Trigger Event User 10</description>
                              <value>15</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TRGSRC10</name>
                        <description>Channel 10 Trigger Source</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>TRGSRC10Select</name>
                           <enumeratedValue>
                              <name>NO_TRIGGER</name>
                              <description>No Trigger (NOP)</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_SOFTWARE_TRIGGER</name>
                              <description>Global Software Trigger</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_LEVEL_TRIGGER</name>
                              <description>Global Level Software Trigger</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SCAN_TRIGGER</name>
                              <description>SCANTRG - Scan Trigger</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SYNC_TRIGGER</name>
                              <description>Synchronous Trigger (STRIG)</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER0</name>
                              <description>ADC Trigger Event User 0</description>
                              <value>5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER1</name>
                              <description>ADC Trigger Event User 1</description>
                              <value>6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER2</name>
                              <description>ADC Trigger Event User 2</description>
                              <value>7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER3</name>
                              <description>ADC Trigger Event User 3</description>
                              <value>8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER4</name>
                              <description>ADC Trigger Event User 4</description>
                              <value>9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER5</name>
                              <description>ADC Trigger Event User 5</description>
                              <value>10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER6</name>
                              <description>ADC Trigger Event User 6</description>
                              <value>11</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER7</name>
                              <description>ADC Trigger Event User 7</description>
                              <value>12</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER8</name>
                              <description>ADC Trigger Event User 8</description>
                              <value>13</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER9</name>
                              <description>ADC Trigger Event User 9</description>
                              <value>14</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER10</name>
                              <description>ADC Trigger Event User 10</description>
                              <value>15</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TRGSRC11</name>
                        <description>Channel 11 Trigger Source</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>TRGSRC11Select</name>
                           <enumeratedValue>
                              <name>NO_TRIGGER</name>
                              <description>No Trigger (NOP)</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_SOFTWARE_TRIGGER</name>
                              <description>Global Software Trigger</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_LEVEL_TRIGGER</name>
                              <description>Global Level Software Trigger</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SCAN_TRIGGER</name>
                              <description>SCANTRG - Scan Trigger</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SYNC_TRIGGER</name>
                              <description>Synchronous Trigger (STRIG)</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER0</name>
                              <description>ADC Trigger Event User 0</description>
                              <value>5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER1</name>
                              <description>ADC Trigger Event User 1</description>
                              <value>6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER2</name>
                              <description>ADC Trigger Event User 2</description>
                              <value>7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER3</name>
                              <description>ADC Trigger Event User 3</description>
                              <value>8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER4</name>
                              <description>ADC Trigger Event User 4</description>
                              <value>9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER5</name>
                              <description>ADC Trigger Event User 5</description>
                              <value>10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER6</name>
                              <description>ADC Trigger Event User 6</description>
                              <value>11</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER7</name>
                              <description>ADC Trigger Event User 7</description>
                              <value>12</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER8</name>
                              <description>ADC Trigger Event User 8</description>
                              <value>13</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER9</name>
                              <description>ADC Trigger Event User 9</description>
                              <value>14</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER10</name>
                              <description>ADC Trigger Event User 10</description>
                              <value>15</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TRGSRC12</name>
                        <description>Channel 12 Trigger Source</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>TRGSRC12Select</name>
                           <enumeratedValue>
                              <name>NO_TRIGGER</name>
                              <description>No Trigger (NOP)</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_SOFTWARE_TRIGGER</name>
                              <description>Global Software Trigger</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_LEVEL_TRIGGER</name>
                              <description>Global Level Software Trigger</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SCAN_TRIGGER</name>
                              <description>SCANTRG - Scan Trigger</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SYNC_TRIGGER</name>
                              <description>Synchronous Trigger (STRIG)</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER0</name>
                              <description>ADC Trigger Event User 0</description>
                              <value>5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER1</name>
                              <description>ADC Trigger Event User 1</description>
                              <value>6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER2</name>
                              <description>ADC Trigger Event User 2</description>
                              <value>7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER3</name>
                              <description>ADC Trigger Event User 3</description>
                              <value>8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER4</name>
                              <description>ADC Trigger Event User 4</description>
                              <value>9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER5</name>
                              <description>ADC Trigger Event User 5</description>
                              <value>10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER6</name>
                              <description>ADC Trigger Event User 6</description>
                              <value>11</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER7</name>
                              <description>ADC Trigger Event User 7</description>
                              <value>12</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER8</name>
                              <description>ADC Trigger Event User 8</description>
                              <value>13</value>
                           </enumeratedValue>
                           <enumeratedValue>
