Ac6Embedded/svd-microchip/PIC32CM_SG00/PIC32CM5112SG00064.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DSU</name>
         <version>044651a0</version>
         <description>Polaris Device Services Unit Macro DOS</description>
         <baseAddress>0x44000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x2000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A REGISTER</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PRIV</name>
                     <description>Privileged Access Only for APB Interface</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PRIVSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Internal Address Space registers accessible in privileged and unprivileged modes. Test functions generate unprivileged requests.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Internal Address Space registers only accessible in privileged mode. Test functions generate privileged requests.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLB</name>
               <description>Control B REGISTER</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DCCDMALVL0</name>
                     <description>DMA Trigger n Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DCCDMALVL0Select</name>
                        <enumeratedValue>
                           <name>EMPTY</name>
                           <description>Trigger n rises when DCCn is read and falls when it is written</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FULL</name>
                           <description>Trigger n rises when DCCn is written and falls when it is read</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DCCDMALVL1</name>
                     <description>DMA Trigger n Level</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DCCDMALVL1Select</name>
                        <enumeratedValue>
                           <name>EMPTY</name>
                           <description>Trigger n rises when DCCn is read and falls when it is written</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FULL</name>
                           <description>Trigger n rises when DCCn is written and falls when it is read</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MISC</name>
                     <description>Device Specific Configuration Register</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLC</name>
               <description>Control C REGISTER</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DBGRW0</name>
                     <description>CPUn Debug R/W</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DBGRW0Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Allow debugger accesses through CPUn to carry the debug attribute (i.e debugger reads are non-destructive).</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Debugger accesses through CPUn do not carry the debug attribute (i.e debugger reads are destructive).</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUSA</name>
               <description>Status A REGISTER</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>Done Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DONESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DSU is executing a command or idle.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>TCTRL.CMD command completed</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BERR</name>
                     <description>Bus Error Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No bus error detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Bus error incurred while performing the DSU command.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERR</name>
                     <description>Protection Error Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No protection error detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Invalid command written to TCTRL.CMD, partial write to the upper or lower bytes of TCTRL.CMD, or invalid key written to SAFEDOOR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ROMCRC</name>
                     <description>Boot ROM CRC Self-Check Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ROMCRCSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>CRC is in progress</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>CRC completed but failed indicating possible issue with the ROM content. System held in lockup state.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>CRC completed and passed</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>CRC never executed because user disabled CRC check through fuse settings.</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRSTEXT0</name>
                     <description>CPUx Reset Extension Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CRSTEXT0Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>CPUx released from reset extension.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>CPUx held in reset extension. Set on Cold-Plugging detection.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BREXT0</name>
                     <description>BootRom 0 Phase Extension Status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BREXT0Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Boot ROM Phase Extension released for CPUx.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Boot ROM Phase Extension for CPUx. Set on Cold-Plugging detection.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUSB</name>
               <description>Status B REGISTER</description>
               <addressOffset>0x108</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BCCD0</name>
                     <description>Boot ROM Communication Channel 0 Dirty</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BCCD0Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>BCCDx.DATA register was read from.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>BCCDx.DATA register was written to.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BCCD1</name>
                     <description>Boot ROM Communication Channel 1 Dirty</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BCCD1Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>BCCDx.DATA register was read from.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>BCCDx.DATA register was written to.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DCCD0</name>
                     <description>Debug Communication Channel 0 Dirty</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DCCD0Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DCCDx.DATA register was read from.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DCCDx.DATA register was written to.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DCCD1</name>
                     <description>Debug Communication Channel 1 Dirty</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DCCD1Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DCCDx.DATA register was read from.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DCCDx.DATA register was written to.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DBGPRES</name>
                     <description>Debugger Present Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DBGPRESSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No debugger detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Debugger probe detected</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HPS</name>
                     <description>Hot-Plugging Status</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>HPSSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Hot-Plugging inactive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Hot-Plugging active</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>BCC[%s]</name>
               <description>Boot ROM Channel n REGISTER</description>
               <addressOffset>0x110</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>DCC[%s]</name>
               <description>Debug Communication Channel n REGISTER</description>
               <addressOffset>0x118</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DID</name>
               <description>Device Identification Register</description>
               <addressOffset>0x120</addressOffset>
               <size>32</size>
               <resetValue>0x00000053</resetValue>
               <fields>
                  <field>
                     <name>FV</name>
                     <description>Fixed Value of 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MANID</name>
                     <description>JEDEC Manufacture ID</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>PNDID</name>
                     <description>Part Number Device ID</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PNMID</name>
                     <description>Part Number Mask ID</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>VER</name>
                     <description>Version Code</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
