Ac6Embedded/svd-microchip/PIC32CM_SG00/PIC32CM5112SG00064.svd
            <register>
               <name>DAL</name>
               <description>Debugger Access Level REGISTER</description>
               <addressOffset>0x124</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CPU0</name>
                     <description>CPU 0 Debugger Access Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CPU0Select</name>
                        <enumeratedValue>
                           <name>SECURED</name>
                           <description>Debugger targeting CPU0 domain can only access the DSU external address space otherwise debugger access is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NS_DEBUG</name>
                           <description>Debugger can access only non-secure regions</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FULL_DEBUG</name>
                           <description>Debugger can access secure and non-secure regions</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CPU1</name>
                     <description>CPU n Debugger Access Level</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CPU1Select</name>
                        <enumeratedValue>
                           <name>SECURED</name>
                           <description>Debugger access is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NS_DEBUG</name>
                           <description>Debugger can access only non-secure regions</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FULL_DEBUG</name>
                           <description>Debugger has full access to debug CPUn</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNIMPLEMENTED</name>
                           <description>Unimplemented CPU</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CPU2</name>
                     <description>CPU n Debugger Access Level</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CPU2Select</name>
                        <enumeratedValue>
                           <name>SECURED</name>
                           <description>Debugger access is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NS_DEBUG</name>
                           <description>Debugger can access only non-secure regions</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FULL_DEBUG</name>
                           <description>Debugger has full access to debug CPUn</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNIMPLEMENTED</name>
                           <description>Unimplemented CPU</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CPU3</name>
                     <description>CPU n Debugger Access Level</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CPU3Select</name>
                        <enumeratedValue>
                           <name>SECURED</name>
                           <description>Debugger access is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NS_DEBUG</name>
                           <description>Debugger can access only non-secure regions</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FULL_DEBUG</name>
                           <description>Debugger has full access to debug CPUn</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNIMPLEMENTED</name>
                           <description>Unimplemented CPU</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENTRY0</name>
               <description>CoreSight ROM Table Entry N Register</description>
               <addressOffset>0x1000</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x9C0FE002</resetValue>
               <fields>
                  <field>
                     <name>EPRES</name>
                     <description>CoreSight Entry Present</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EPRESSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Entry not present</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Entry present</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FMT</name>
                     <description>CoreSight Rom Table Format</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FMTSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>8-bit format</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>32-bit format</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADDOFF</name>
                     <description>CoreSight ROM Table Address Offset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENTRY1</name>
               <description>CoreSight ROM Table Entry N Register</description>
               <addressOffset>0x1004</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0xBBFFF002</resetValue>
               <fields>
                  <field>
                     <name>EPRES</name>
                     <description>CoreSight Entry Present</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EPRESSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Entry not present</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Entry present</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FMT</name>
                     <description>CoreSight Rom Table Format</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FMTSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>8-bit format</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>32-bit format</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADDOFF</name>
                     <description>CoreSight ROM Table Address Offset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENTRY2</name>
               <description>CoreSight ROM Table Entry N Register</description>
               <addressOffset>0x1008</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0xBBFFF002</resetValue>
               <fields>
                  <field>
                     <name>EPRES</name>
                     <description>CoreSight Entry Present</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EPRESSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Entry not present</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Entry present</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FMT</name>
                     <description>CoreSight Rom Table Format</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FMTSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>8-bit format</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>32-bit format</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADDOFF</name>
                     <description>CoreSight ROM Table Address Offset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENTRY3</name>
               <description>CoreSight ROM Table Entry N Register</description>
               <addressOffset>0x100C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0xBBFFF002</resetValue>
               <fields>
                  <field>
                     <name>EPRES</name>
                     <description>CoreSight Entry Present</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EPRESSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Entry not present</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Entry present</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FMT</name>
                     <description>CoreSight Rom Table Format</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FMTSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>8-bit format</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>32-bit format</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADDOFF</name>
                     <description>CoreSight ROM Table Address Offset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENTRY4</name>
               <description>CoreSight ROM Table Entry 4 Register</description>
               <addressOffset>0x1010</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EPRES</name>
                     <description>CoreSight Entry Present</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EPRESSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Entry not present</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Entry present</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FMT</name>
                     <description>CoreSight Rom Table Format</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FMTSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>8-bit format</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>32-bit format</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADDOFF</name>
                     <description>CoreSight ROM Table Address Offset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENTRY5</name>
               <description>CoreSight ROM Table Entry 5 Register</description>
               <addressOffset>0x1014</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EPRES</name>
                     <description>CoreSight Entry Present</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EPRESSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Entry not present</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Entry present</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FMT</name>
                     <description>CoreSight Rom Table Format</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FMTSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>8-bit format</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>32-bit format</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADDOFF</name>
                     <description>CoreSight ROM Table Address Offset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENTRY6</name>
               <description>CoreSight ROM Table Entry 6 Register</description>
               <addressOffset>0x1018</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EPRES</name>
                     <description>CoreSight Entry Present</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EPRESSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Entry not present</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Entry present</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FMT</name>
                     <description>CoreSight Rom Table Format</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FMTSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>8-bit format</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>32-bit format</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADDOFF</name>
                     <description>CoreSight ROM Table Address Offset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
