Ac6Embedded/svd-microchip/PIC32CM_SG00/PIC32CM5112SG00064.svd
               <register>
                  <name>CHINTENSET</name>
                  <description>Channel n Interrupt Enable Set</description>
                  <addressOffset>0x5</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>OVR</name>
                        <description>Channel Overrun Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EVD</name>
                        <description>Channel Event Detected Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHINTFLAG</name>
                  <description>Channel n Interrupt Flag Status and Clear</description>
                  <addressOffset>0x6</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>OVR</name>
                        <description>Channel Overrun</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EVD</name>
                        <description>Channel Event Detected</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHSTATUS</name>
                  <description>Channel n Status</description>
                  <addressOffset>0x7</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x01</resetValue>
                  <fields>
                     <field>
                        <name>RDYUSR</name>
                        <description>Ready User</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUSYCH</name>
                        <description>Busy Channel</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <dim>62</dim>
               <dimIncrement>1</dimIncrement>
               <name>USER[%s]</name>
               <description>User Multiplexer n</description>
               <addressOffset>0x120</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CHANNEL</name>
                     <description>Channel Event Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>FCR</name>
         <version>049722a0</version>
         <description>Polaris Flash Read Controller</description>
         <baseAddress>0x44002000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x6C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>FCR</name>
            <value>0</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>CTRL A REGISTER</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>PRIV</name>
                     <description>Privileged Access Only</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PRIVSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Macro register accessible in privileged and unprivileged accesses.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Macro registers only accessible in privileged accesses</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FWS</name>
                     <description>Flash Access Time Defined in terms of AHB Clock Wait States</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>FWSSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Zero Wait States</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>One Wait State</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>14</name>
                           <description>Fourteen Wait States</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>15</name>
                           <description>Fifteen Wait States</description>
                           <value>15</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADRWS</name>
                     <description>Address Wait State Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ADRWSSelect</name>
                        <enumeratedValue>
                           <name>ZERO</name>
                           <description>Add 0 Address Wait States - allowing for higher performance at lower clock frequencies</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONE</name>
                           <description>Add 1 Address Wait State - allowing for higher clock frequencies</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AUTOWS</name>
                     <description>Automatic Wait State Enable.</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>AUTOWSSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Use FWS: Total flash wait states are ADRWS + FWS</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Use Automatic wait states: Total flash wait states are ADRWS + Taws</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RDBUFWS</name>
                     <description>Read Buffer Wait StatesPer AHB port control of deterministic or zero wait state read buffer access.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RDBUFWSSelect</name>
                        <enumeratedValue>
                           <name>ZEROWS</name>
                           <description>0 Wait States</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DETERMINISTIC</name>
                           <description>ADRWS + FWS wait state for hits to AHB read buffer</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLB</name>
               <description>CTRL B REGISTER</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PRM</name>
                     <description>Set NVM Power Reduction Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PRMSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TOGGLE</name>
                           <description>Toggle the Flash Power Mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHEINV</name>
                     <description>Cache InvalidateCache invalidation takes 1 clock cycle, but may be delayed by an active read.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CHEINVSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INV</name>
                           <description>Invalidate Cache</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SLP</name>
                     <description>NVM Power Reduction Mode selection during System Standby Sleep</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SLPSelect</name>
                        <enumeratedValue>
                           <name>MANUAL</name>
                           <description>Maintain state of STATUS.PRM on entry to Standby</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RSVD01</name>
                           <description>RSVD</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUTOFAST</name>
                           <description>Enter Flash Hibernate on entry to Standby w/ wakeup to Auto Standby</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUTOSLOW</name>
                           <description>Enter Flash Hibernate on entry to Standby w/ wakeup on first access</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHEDIS</name>
                     <description>Cache Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CHEDISSelect</name>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Cache Enabled; Accesses to flash use AUTOWS/FSW selection.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Cache Disabled; Interface uses RDBUFWS selection.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PREFDIS</name>
                     <description>Prefetch Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PREFDISSelect</name>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Predictive Prefetch Enabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Predictive Prefetch Disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear REGISTER</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>SERR</name>
                     <description>Flash SEC Interrupt Clear Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCDONE</name>
                     <description>CRC Calculation Done Clear Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CRCDONESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCERR</name>
                     <description>CRC Error Clear Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CRCERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FLTCAP</name>
                     <description>ECC Fault Capture Clear Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FLTCAPSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable SET REGISTER</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <modifiedWriteValues>oneToSet</modifiedWriteValues>
               <fields>
                  <field>
                     <name>SERR</name>
                     <description>Flash SEC Interrupt Set Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCDONE</name>
                     <description>CRC Calculation Done Set Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CRCDONESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCERR</name>
                     <description>CRC Error Set Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CRCERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FLTCAP</name>
                     <description>ECC Fault Capture Set Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FLTCAPSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
