Ac6Embedded/svd-microchip/PIC32CM_SG00/PIC32CM5112SG00064.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>HSM</name>
         <version>047771a0</version>
         <description>Cryptographic Acceleration Module Lite</description>
         <baseAddress>0x4F000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x12028</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>HSM</name>
            <value>139</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control Register A</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset1 = Reset registers and internal state0 = No effect</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Macro/Clock Enable bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENABLESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>HSM clock is not requested and macros is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>HSM clock is requested and macro is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRIV</name>
                     <description>Privileged Access Only - This bit affects all Wrapper and EIP registers.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PRIVSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>HSM registers accessible in privileged and unprivileged modes. Master Requests are NOT privileged</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>HSM registers only accessible in privileged mode.  Master Requests are also privileged.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run In Standby bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RUNSTDBYSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>HSM clock is disabled in Standby Sleep mode, clock requests are de-asserted after any pending bus transactions or requests are completed.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>If enabled, the HSM clock remains requested in Standby Sleep mode.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUSA</name>
               <description>STATUS Register A</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OTPLOCK</name>
                     <description>OTP Lock bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>OTPLOCKSelect</name>
                        <enumeratedValue>
                           <name>1</name>
                           <description>OTP lock bit set. Device not in IC manufacturing.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCBUSY</name>
               <description>SYNCBUSY Register</description>
               <addressOffset>0x5C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Synchronization Busy1 = SWRST synchronization is busy0 = SWRST synchronization is NOT busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Macro Enable Synchronization Busy</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENABLESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>ENABLE synchronization is NOT busy.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>ENABLE synchronization is busy.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_DMA_Registers__FETCH_ADDR_LSB</name>
               <addressOffset>0x10000</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FETCH_ADDR_LSB</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_DMA_Registers__FETCH_ADDR_MSB</name>
               <addressOffset>0x10004</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FETCH_ADDR_MSB</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_DMA_Registers__FETCH_LEN</name>
               <addressOffset>0x10008</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FETCH_LEN</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
                  <field>
                     <name>FETCH_CSTADDR</name>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FETCH_REALIGN</name>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FETCH_ZPADDING</name>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_DMA_Registers__FETCH_TAG</name>
               <addressOffset>0x1000C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FETCH_TAG</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_DMA_Registers__PUSH_ADDR_LSB</name>
               <addressOffset>0x10010</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PUSH_ADDR_LSB</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_DMA_Registers__PUSH_ADDR_MSB</name>
               <addressOffset>0x10014</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PUSH_ADDR_MSB</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_DMA_Registers__PUSH_LEN</name>
               <addressOffset>0x10018</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PUSH_LEN</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
                  <field>
                     <name>PUSH_CSTADDR</name>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PUSH_REALIGN</name>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PUSH_DISCARD</name>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_DMA_Registers__INT_EN</name>
               <addressOffset>0x1001C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INT_EN</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_DMA_Registers__INT_ENSET</name>
               <addressOffset>0x10020</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INT_ENSET</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_DMA_Registers__INT_ENCLR</name>
               <addressOffset>0x10024</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INT_ENCLR</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_DMA_Registers__INT_STATRAW</name>
               <addressOffset>0x10028</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INT_STATRAW</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_DMA_Registers__INT_STAT</name>
               <addressOffset>0x1002C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INT_STAT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_DMA_Registers__INT_STATCLR</name>
               <addressOffset>0x10030</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INT_STATCLR</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_DMA_Registers__CONFIG</name>
               <addressOffset>0x10034</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FETCH_CTRL_INDIRECT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PUSH_CTRL_INDIRECT</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FETCH_STOP</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PUSH_STOP</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOFT_RST</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_DMA_Registers__START</name>
               <addressOffset>0x10038</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>START_FETCH</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>START_PUSH</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_DMA_Registers__STATUS</name>
               <addressOffset>0x1003C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FETCH_BUSY</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PUSH_BUSY</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FETCH_NOT_EMPTY</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PUSH_WAITINGFIFO</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOFT_RST_BUSY</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PUSH_NBDATA</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG</name>
               <addressOffset>0x10400</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000611</resetValue>
               <fields>
                  <field>
                     <name>BA411_AES_INCLUDED</name>
                     <description>Generic g_IncludeAES value. BA411E-AES IP included if set</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA415_HP_AES_GCM_INCLUDED</name>
                     <description>Generic g_IncludeAESGCM value. BA415-HP-AES-GCM IP included if set</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA416_HP_AES_XTS_INCLUDED</name>
                     <description>Generic g_IncludeAESXTS value. BA416-HP-AES-XTS IP included if set</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA412_DES_INCLUDED</name>
                     <description>Generic g_IncludeDES value. BA412-3DES IP included if set</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA413_HASH_INCLUDED</name>
                     <description>Generic g_IncludeHASH value. BA413-HASH IP included if set</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA417_CHACHAPOLY_INCLUDED</name>
                     <description>Generic g_IncludeChachaPoly value. BA417-ChaChaPoly IP included if set</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA418_SHA3_INCLUDED</name>
                     <description>Generic g_IncludeSHA3  value. BA418-SHA3 IP included if set</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA421_ZUC_INCLUDED</name>
                     <description>Generic g_IncludeZUC  value. BA421-ZUC IP included if set</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA419_SM4_INCLUDED</name>
                     <description>Generic g_IncludeSM4  value. BA419-SM4 IP included if set</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA414EP_PKE_INCLUDED</name>
                     <description>Generic g_IncludePKE  value. BA414EP-PKE IP included if set</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA431_NDRNG_INCLUDED</name>
                     <description>Generic g_IncludeNDRNG  value. BA431-NDRNG IP included if set</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA420_HP_CHACHAPOLY_INCLUDED</name>
                     <description>Generic g_IncludeHPChachaPoly  value. BA420-HP-ChaChaPoly IP included if set</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA423_SNOW3G_INCLUDED</name>
                     <description>Generic g_IncludeSnow3G  value. BA423-Snow3G IP included if set</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA422_KASUMI_INCLUDED</name>
                     <description>Generic g_IncludeKasumi  value. BA422-Kasumi IP included if set</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
