Ac6Embedded/svd-microchip/PIC32CM_SG00/PIC32CM5112SG00064.svd
            <register>
               <name>CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1</name>
               <addressOffset>0x10404</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x1F0301FF</resetValue>
               <fields>
                  <field>
                     <name>BA411E_AES_HW_CFG_MODE</name>
                     <description>Generic g_AesModesPoss value. BA411E-AES engine configuration.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>BA411E_AES_HW_CFG_CS</name>
                     <description>Generic g_CS value. BA411E-AES engine configuration.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA411E_AES_HW_CFG_MASKING</name>
                     <description>Generic g_UseMasking value. BA411E-AES engine configuration.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA411E_AES_HW_CFG_KEYSIZE</name>
                     <description>Generic g_Keysize value. BA411E-AES engine configuration.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>BA411E_AES_HW_CFG_CXSWITCH</name>
                     <description>Generic g_CxSwitch value. BA411E-AES engine configuration.</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA411E_AES_HW_CFG_GLITCHPROTECTION</name>
                     <description>Generic g_GlitchProtection value. BA411E-AES engine configuration.</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2</name>
               <description>Generic g_CtrSize value. BA411E-AES engine configuration.</description>
               <addressOffset>0x10408</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00200080</resetValue>
               <fields>
                  <field>
                     <name>BA411E_AES_HW_CFG_2_CTRSIZE</name>
                     <description>Generic g_CtrSize value. BA411E-AES engine configuration.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>BA411E_AES_HW_CFG_2_EXTKEYS</name>
                     <description>Generic g_Ext_nb_AES_keys value. BA411E-AES engine configuration.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BA411E_AES_HW_CFG_2_IKGKEYS</name>
                     <description>Generic  g_IKG_nb_AES_keys value. BA411E-AES engine configuration.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG</name>
               <addressOffset>0x1040C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0013003E</resetValue>
               <fields>
                  <field>
                     <name>BA413_HASH_HW_CFG_MASK</name>
                     <description>Generic g_HashMaskFunc value. BA413-Hash engine configuration.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>BA413_HASH_HW_CFG_PADDING</name>
                     <description>Generic g_HashPadding value. BA413-Hash engine configuration.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA413_HASH_HW_CFG_HMAC</name>
                     <description>Generic g_HMAC_enabled value. BA413-Hash engine configuration.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA413_HASH_HW_CFG_VERIFYDIGEST</name>
                     <description>Generic g_HashVerifyDigest value. BA413-Hash engine configuration.</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BA413_HASH_HW_CFG_EXTKEYS</name>
                     <description>Generic g_Ext_nb_Hash_keys value. BA413-Hash engine configuration.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BA413_HASH_HW_CFG_IKGKEYS</name>
                     <description>Generic g_IKG_nb_Hash_keys value. BA413-Hash engine configuration.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG</name>
               <description>Generic g_Sha3CtxtEn value. BA418-SHA3 configuration.</description>
               <addressOffset>0x10410</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BA418_SHA3_HW_CFG</name>
                     <description>Generic g_Sha3CtxtEn value. BA418-SHA3 configuration.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG</name>
               <description>Generic g_SM4ModesPoss value. BA419-SM4 engine configuration.</description>
               <addressOffset>0x10414</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x000001FF</resetValue>
               <fields>
                  <field>
                     <name>BA419_SM4_HW_CFG</name>
                     <description>Generic g_SM4ModesPoss value. BA419-SM4 engine configuration.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG</name>
               <description>Generic g_aria_modePoss value. BA424-Aria engine configuration.</description>
               <addressOffset>0x10418</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0000017F</resetValue>
               <fields>
                  <field>
                     <name>BA424_ARIA_HW_CFG</name>
                     <description>Generic g_aria_modePoss value. BA424-Aria engine configuration.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__Control</name>
               <description>Control register</description>
               <addressOffset>0x11000</addressOffset>
               <size>32</size>
               <resetValue>0x00040000</resetValue>
               <fields>
                  <field>
                     <name>Enable</name>
                     <description>Enable the NDRNG.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LFSREn</name>
                     <description>Select between the NDRNG with asynchronous free running oscillators (when '0') and the Pseudo-Random generator with synchronous oscillators for simulation purpose (when '1').</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TestEn</name>
                     <description>Select input for conditioning function and continuous tests: 0: Noise source (normal mode), 1: Test data register (test mode).</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CondBypass</name>
                     <description>0: the conditioning function is used (normal mode), 1: the conditioning function is bypassed (to observe entropy source directly).</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IntEnRep</name>
                     <description>Interrupt enable for Repetition Count Test failure.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IntEnProp</name>
                     <description>Interrupt enable for Adaptive Proportion Test failure (1024-sample window).</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IntEnFull</name>
                     <description>Interrupt enable for FIFO full.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SoftRst</name>
                     <description>Software reset: 0: Normal mode, 1: The continuous test, the conditioning function and the FIFO are reset. This bit is not cleared automatically.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IntEnPre</name>
                     <description>Interrupt enable for AIS31 preliminary noise alarm.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IntEnAlm</name>
                     <description>Interrupt enable for AIS31 noise alarm.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ForceActiveROs</name>
                     <description>Force oscillators to run when FIFO is full.</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HealthTestBypass</name>
                     <description>Bypass NIST tests such that the results of the start-up and online test do not affect the FSM state.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AIS31Bypass</name>
                     <description>Bypass AIS31 tests such that the results of the start-up and online tests do not affect the FSM state.</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HealthTestSel</name>
                     <description>Select input to health test module: 0: Before conditioning, 1: After conditioning.</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AIS31TestSel</name>
                     <description>Select input to the AIS31 test module: 0: Before conditioning, 1: After conditioning.</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Nb128BitBlocks</name>
                     <description>Number of 128 bit blocks used in AES-CBCMAC post-processing. This value cannot be zero.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FifoWriteStartUp</name>
                     <description>Enable write of the samples in the FIFO during start-up.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__FIFOLevel</name>
               <description>FIFO level register.</description>
               <addressOffset>0x11004</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FIFOLevel</name>
                     <description>Number of 32 bits words of random available in the FIFO. Any write to this register clears the FullInt flag in the Status register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__FIFOThreshold</name>
               <description>FIFO threshold register.</description>
               <addressOffset>0x11008</addressOffset>
               <size>32</size>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>FIFOThreshold</name>
                     <description>FIFO level below which the module leaves the idle state to refill the FIFO, expressed in number of 128bit blocks.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__FIFODepth</name>
               <description>FIFO depth register.</description>
               <addressOffset>0x1100C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000008</resetValue>
               <fields>
                  <field>
                     <name>FIFODepth</name>
                     <description>Maximum number of 32 bits words that can be stored in the FIFO: 2**g_fifodepth.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__Key0</name>
               <description>Key register (MSB).</description>
               <addressOffset>0x11010</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>Key0</name>
                     <description>Key register (MSB).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__Key1</name>
               <description>Key register.</description>
               <addressOffset>0x11014</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>Key1</name>
                     <description>Key register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__Key2</name>
               <description>Key register.</description>
               <addressOffset>0x11018</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>Key2</name>
                     <description>Key register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__Key3</name>
               <description>Key register (LSB).</description>
               <addressOffset>0x1101C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>Key3</name>
                     <description>Key register (LSB).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__TestData</name>
               <description>Test data register.</description>
               <addressOffset>0x11020</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TestData</name>
                     <description>Test data register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__RepeatThreshold</name>
               <description>Repetition Test Count Cut-Off value.</description>
               <addressOffset>0x11024</addressOffset>
               <size>32</size>
               <resetValue>0x00000029</resetValue>
               <fields>
                  <field>
                     <name>RepeatThreshold</name>
                     <description>Repetition Test Count Cut-Off value.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__PropThreshold</name>
               <description>Adaptive Proportion Test (1024-sample window) Cut-Off value.</description>
               <addressOffset>0x11028</addressOffset>
               <size>32</size>
               <resetValue>0x00000319</resetValue>
               <fields>
                  <field>
                     <name>PropThreshold</name>
                     <description>Adaptive Proportion Test (1024-sample window) Cut-Off value.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__Status</name>
               <description>Status register.</description>
               <addressOffset>0x11030</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TestDataBusy</name>
                     <description>High when data written to TestData register is being processed. (see section 4.7)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>State</name>
                     <description>State of the control FSM: 000: Reset, 001: Startup, 010: Idle (Rings On), 011: Idle (Rings Off), 100: Fill FIFO, 101: Error, 110: Unused, 111: Unused.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RepFail</name>
                     <description>NIST-800-90B repetition Count Test interrupt status.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PropFail</name>
                     <description>NIST-800-90B adaptive Proportion Test (1024-sample window) interrupt status.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FullInt</name>
                     <description>FIFO full status.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PreInt</name>
                     <description>AIS31 preliminary noise alarm interrupt status.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AlmInt</name>
                     <description>AIS31 noise alarm interrupt status.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>StartUpFail</name>
                     <description>Start-up test failure.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FifoAccFail</name>
                     <description>Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel = 0).</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
