Ac6Embedded/svd-microchip/PIC32CM_SG00/PIC32CM5112SG00064.svd
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK25Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK26</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK26Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK27</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK27Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK28</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK28Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK29</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK29Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK30</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK30Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK31</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK31Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
