Ac6Embedded/svd-microchip/PIC32CM_SG00/PIC32CM5112SG00064.svd
            <register>
               <name>QK_DATA_SRC</name>
               <description>Data Source register; The Data Source register defines via which interface data must be provided to QuiddiKey. Combinations of bits may be 1 at a time.</description>
               <addressOffset>0x224</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>qk_src_dir</name>
                     <description>Data must be provided via the QK_DIR register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_src_si</name>
                     <description>Data must be provided via the SI interface</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_KEY_INDEX</name>
               <description>Key Index register; The Key Index register provides the index of the key that is currently output.</description>
               <addressOffset>0x228</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>qk_key_inde</name>
                     <description>Value of the Key Index</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_DIR</name>
               <description>Data Input register; The Data Input register is used to transfer data to QuiddiKey. It can only be written when input data is requested (indicated by the qk_di_request signal). When written at any other moment, or when read, an error response is generated. Depending on the way the system is configured and connected, this may generate an exception.</description>
               <addressOffset>0x2A0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>qk_di</name>
                     <description>Input data to QuiddiKey</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_DOR</name>
               <description>Data Output register; The Data Output register is used to transfer data from QuiddiKey. It can only be read when input data is available (indicated by the qk_do_request signal). When read at any other moment, or when written, an error response is generated. Depending on the way the system is configured and connected, this may generate an exception.</description>
               <addressOffset>0x2A8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>qk_do</name>
                     <description>Output data from QuiddiKey</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_MISC</name>
               <description>Miscellaneous register; The Miscellaneous register defines miscellaneous settings for QuiddiKey. These usually need to be configured only once after power up orreset.</description>
               <addressOffset>0x2C0</addressOffset>
               <size>32</size>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>qk_data_endianness</name>
                     <description>Defines the endianness of data in QK_DIR and QK_DOR: 0: Little endian 1: Big endian (default)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_IF_SR</name>
               <description>Interface Status register; The status of the interface can be monitored with the Interface Status register. Writing 1 to a bit, clears the corresponding bit.</description>
               <addressOffset>0x2D0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>reg_if_error</name>
                     <description>An error has occurred at the register interface</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_TEST</name>
               <description>Test register; With the Test register a BIST can be started. It also shows the result of the last BIST.</description>
               <addressOffset>0x2D8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>qk_bist_enable</name>
                     <description>Isolates QuiddiKey and runs BIST</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_bist_running</name>
                     <description>BIST is in progress or finishing up (after qk_bist_enable = 0)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_bist_active</name>
                     <description>BIST is in progress</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_bist_ok</name>
                     <description>BIST has passed</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_bist_error</name>
                     <description>BIST has failed</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_allow_bist</name>
                     <description>BIST is not allowed</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_PSR</name>
               <description>PUF Score register; The PUF Score register shows the value of the PUF Score that was obtained during the last Test PUF, Enroll, Start or Reconstruct operation.</description>
               <addressOffset>0x2DC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0000000F</resetValue>
               <fields>
                  <field>
                     <name>qk_puf_score</name>
                     <description>PUF score obtained during the last Test PUF, Enroll, Start or Reconstruct operation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_HW_RUC0</name>
               <description>Module Restrict User Context 0 register; The Module Restrict User Context 0 register shows the values of the qk_restrict_user_context_0 signal on the signal interface.</description>
               <addressOffset>0x2E0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>qk_restrict_user_context_0</name>
                     <description>For each bit in the User_Context_0 field: 0: This bit can be used 1: This bit cannot be used</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_HW_RUC1</name>
               <description>Module Restrict User Context 1 register; The Module Restrict User Context 1 register shows the values of the qk_restrict_user_context_1 signal on the signal interface.</description>
               <addressOffset>0x2E4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>qk_restrict_user_context_1</name>
                     <description>For each bit in the User_Context_1 field: 0: This bit can be used 1: This bit cannot be used</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_HW_SETTINGS</name>
               <description>Module Settings register; The Module Settings register shows the values of the module settings on the signal interface.</description>
               <addressOffset>0x2F0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>qk_disable_enroll</name>
                     <description>0: Enroll operations are enabled 1: Enroll operations are disabled</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_disable_start</name>
                     <description>0: Start operations are enabled 1: Start operations are disabled</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_disable_reconstruct</name>
                     <description>0: Reconstruct operations are enabled 1: Reconstruct operations are disabled</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_disable_stop</name>
                     <description>0: Stop operations are enabled 1: Stop operations are disabled</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_disable_get_key</name>
                     <description>0: Get Key operations are enabled 1: Get Key operations are disabled</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_disable_unwrap</name>
                     <description>0: Unwrap operations are enabled 1: Unwrap operations are disabled</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_disable_wrap_generated_random</name>
                     <description>0: Wrap Generated Random operations are enabled 1: Wrap Generated Random operations are disabled</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_disable_wrap</name>
                     <description>0: Wrap operations are enabled 1: Wrap operations are disabled</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_disable_generate_random</name>
                     <description>0: Generate Random operations are enabled 1: Generate Random operations are disabled</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_skip_memory_test</name>
                     <description>0: Includes memory test during initialization 1: Skips memory test during initialization</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_disable_test_memory</name>
                     <description>0: Test Memory operations are enabled 1: Test Memory operations are disabled</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_disable_test_puf</name>
                     <description>0: Test PUF operations are enabled 1: Test PUF operations are disabled</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_HW_INFO</name>
               <description>Module Information register; The Module Information register indicates which configuration of QuiddiKey is used for this module and which options it includes.</description>
               <addressOffset>0x2F4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x21400000</resetValue>
               <fields>
                  <field>
                     <name>qk_config_sp_800_90</name>
                     <description>1: SP 800-90 option is included 0: SP 800-90 option is not included</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_config_bist</name>
                     <description>1: BIST is included 0: BIST is not included</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_config_wrap</name>
                     <description>1: Wrap is included 0: Wrap is not included</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_config_type</name>
                     <description>QuiddiKey configuration</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>qk_config_typeSelect</name>
                        <enumeratedValue>
                           <name>IID_QK_SAFE</name>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_PLUS</name>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_HW_ID</name>
               <description>Module Identifier register; The Module Identifier register provides the identifier of the QuiddiKey Engine netlist.</description>
               <addressOffset>0x2F8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x20120702</resetValue>
               <fields>
                  <field>
                     <name>qk_hw_id</name>
                     <description>Module identifier</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_HW_VER</name>
               <description>Module Version register; The Module Version register provides the version of this module: major.minor.patch.</description>
               <addressOffset>0x2FC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00030701</resetValue>
               <fields>
                  <field>
                     <name>qk_hw_rev</name>
                     <description>Module version, patch part</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>qk_hw_version_minor</name>
                     <description>Module version, minor part</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>qk_hw_version_major</name>
                     <description>Module version, major part</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
